---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ExcludedElementsRestoredInLink
source: html/3938e953-ccb7-10ab-9046-98f28a1097d7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ExcludedElementsRestoredInLink Property

Excluded elements restored in the link.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExcludedElementsRestoredInLink { get; }
```